
## Terraform plan for environment: `int`

**Commit:** 71717665ff19e820a47695a88ad5140c9cf4319e


**API version:** 790df66870
**CLI version:** 790df66870
**Selfserve version:** 790df66870
**Internal version:** 790df66870

### Plan summary

`1 to add, 1 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0]
```
**📖 Reads**

```tf
module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0]
```
**🔄 Updates**

```tf
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
```


----

<details data-gh-workflow="int-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "vol-app-int-selfserve-service"
      + task_role_arn        = (known after apply)
    }

  # module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0] will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:054614622558:service/vol-app-int-selfserve-cluster/vol-app-int-selfserve-service"
        name                               = "vol-app-int-selfserve-service"
        tags                               = {}
      ~ task_definition                    = "vol-app-int-selfserve-service:39" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0] must be replaced
+/- resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:054614622558:task-definition/vol-app-int-selfserve-service:39" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:054614622558:task-definition/vol-app-int-selfserve-service" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                      ~ {
                            name  = "APP_VERSION"
                          ~ value = "02aa445fea" -> "790df66870"
                        },
                        {
                            name  = "CDN_URL"
                            value = "d36shynblr0xo9.cloudfront.net"
                        },
                        # (2 unchanged elements hidden)
                    ]
                  ~ image                  = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/selfserve:02aa445fea" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/selfserve:790df66870"
                    name                   = "selfserve"
                    # (16 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "vol-app-int-selfserve-service" -> (known after apply)
      ~ revision                 = 39 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

</details>